Revit 2026 API

# ForgeTypeIdTypeId Property

---

The schema identifier.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string TypeId { get; set; }
```
```vb
Public Property TypeId As String
	Get
	Set
```
```cpp
public:
property String^ TypeId {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member TypeId : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

ForgeTypeId Class

Autodesk.Revit.DB Namespace